---
title: VertexIndexPairArray
classe: Autodesk.Revit.DB.VertexIndexPairArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# VertexIndexPairArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `vertexIndexPairArray.IsEmpty` | Boolean |
| `VertexIndexPair Item { get; set; }` | `vertexIndexPairArray.Item` | VertexIndexPair |
| `Int32 Size { get; }` | `vertexIndexPairArray.Size` | Int32 |
| `Void Append(VertexIndexPair)` | `vertexIndexPairArray.Append(item)` | Void |
| `Void Clear()` | `vertexIndexPairArray.Clear()` | Void |
| `VertexIndexPairArrayIterator ForwardIterator()` | `vertexIndexPairArray.ForwardIterator()` | VertexIndexPairArrayIterator |
| `IEnumerator GetEnumerator()` | `vertexIndexPairArray.GetEnumerator()` | IEnumerator |
| `Void Insert(VertexIndexPair, Int32)` | `vertexIndexPairArray.Insert(item, index)` | Void |
| `VertexIndexPairArrayIterator ReverseIterator()` | `vertexIndexPairArray.ReverseIterator()` | VertexIndexPairArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```